// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Запрос чисел от пользователя

Console.WriteLine("Введите числа: ");
int number1 = Convert.ToInt32(Console.ReadLine());
int number2 = Convert.ToInt32(Console.ReadLine());
    if (number1 > number2)
        {
            Console.WriteLine(number1);
        }

    if  (number2 > number1)
        {
            Console.WriteLine(number2);
        }
    if (number1 == number2)
        {
            Console.WriteLine("Числа равны");
        }
        
     
        
                  
        

    


